--- a/source/_posts/lang/django-rest-framework.md
+++ b/source/_posts/lang/django-rest-framework.md
@@ -784,27 +789,28 @@ class SerializerGroup(APIView):
 - 继承关系
     - `django`应该可以继承`View`，`rest framework`应用可以使用下面所有视图类。常用：`ModelViewSet`、`GenericViewSet`、`APIView`
 
-```mermaid
-classDiagram
-    View <|-- APIView
-    APIView <|-- GenericAPIView
+```plantuml
+@startuml
+View <|-- APIView
+APIView <|-- GenericAPIView
 
-    ViewSetMixin <|-- GenericViewSet
-    GenericAPIView <|-- GenericViewSet
+ViewSetMixin <|-- GenericViewSet
+GenericAPIView <|-- GenericViewSet
 
-    CreateModelMixin <|-- ModelViewSet
-    RetrieveModelMixin <|-- ModelViewSet
-    UpdateModelMixin <|-- ModelViewSet
-    DestroyModelMixin <|-- ModelViewSet
-    ListModelMixin <|-- ModelViewSet
-    GenericViewSet <|-- ModelViewSet
+CreateModelMixin <|-- ModelViewSet
+RetrieveModelMixin <|-- ModelViewSet
+UpdateModelMixin <|-- ModelViewSet
+DestroyModelMixin <|-- ModelViewSet
+ListModelMixin <|-- ModelViewSet
+GenericViewSet <|-- ModelViewSet
+@enduml
 ```
 
 - `ModelViewSet`使用
     - 路由配置
